PinkFluffyUnic0rn/stm32flight/main.c
	return 0;
}

/**
* @brief Stabilization loop. Callback for TEV_PID periodic event.
	It is the place where is almost all work happening.
* @param ms microsecond passed from last callback invocation
* @return always 0
*/
int stabilize(int ms)
{
	static float prevalt = 0.0;
	float ltm, lbm, rbm, rtm;
	float roll, pitch, yaw;
	float rollcor, pitchcor, yawcor, thrustcor;
	float vx, vy, vz;
	float gvx, gvy, gvz;
	float gy, gx, gz;
	float ay, ax, az;
	float va;
	float ht;
	float dt;
	float alt;
	float tiltcoef;
	float altcor;

	// debug pin switching
	HAL_GPIO_WritePin(debuggpio, debugpin,
		!(HAL_GPIO_ReadPin(debuggpio, debugpin)));

	// emergency disarm happened
	if (Emergencydisarm) {
		setthrust(Dev + DEV_DSHOT, 0.0, 0.0, 0.0, 0.0);
		En = 0.0;
	}

	// get time passed from last invocation of this calback function
	dt = ms / (float) TICKSPERSEC;

	// divide-by-zero protection
	dt = (dt < 0.000001) ? 0.000001 : dt;

	// update battery voltage
	writelog(LOG_BAT, dsp_getlpf(Lpf + LPF_BAT));

	// toggle arming indication led
	HAL_GPIO_WritePin(armgpio, armpin,
		(En > 0.5) ? GPIO_PIN_SET : GPIO_PIN_RESET);

	// apply accelerometer offsets
	ax = dsp_getlpf(Lpf + LPF_ACCX);
	ay = dsp_getlpf(Lpf + LPF_ACCY);
	az = dsp_getlpf(Lpf + LPF_ACCZ);

	// update vertical acceleration low-pass filter
	dsp_updatelpf(Lpf + LPF_THR, Imudata.afz);

	// convert gyroscope values into radians
	gx = deg2rad(dsp_getlpf(Lpf + LPF_GYROX));
	gy = deg2rad(dsp_getlpf(Lpf + LPF_GYROY));
	gz = deg2rad(dsp_getlpf(Lpf + LPF_GYROZ));

	// update complimenraty filter for roll axis and get next roll
	// value. First signal (value) is signal to be integrated: it's
	// the speed of the rotation around Y axis. Second signal is
	// signal to be low-pass filtered: it's the tilt value that is
	// calculated from acceleromer readings through some
	// trigonometry.
	roll = dsp_updatelpf(Lpf + LPF_ROLL,
		dsp_updatecompl(Cmpl + CMPL_ROLL, gy * dt,
			atan2f(-ax, az) - St.adj.att0.roll));

	// same as for roll but for different axes
	pitch = dsp_updatelpf(Lpf + LPF_PITCH,
		dsp_updatecompl(Cmpl + CMPL_PITCH, gx * dt,
			atan2f(ay, sqrt(ax * ax + az * az))) 
				- St.adj.att0.pitch);

	// update complimenraty filter for yaw axis and get next yaw
	// value. First signal is the speed of the rotation around Z
	// axis. Second signal is the heading value that is
	// calculated from magnetometer readings.
	yaw = dsp_updatelpf(Lpf + LPF_YAW,
		circf(dsp_updatecirccompl(Cmpl + CMPL_YAW, -gz * dt,
		qmc_heading(roll, -pitch,
			Qmcdata.fx, Qmcdata.fy, Qmcdata.fz)) 
			- St.adj.att0.yaw));

	// calculate gravity direction vector in IMU coordination system
	// using pitch and roll values;
	vx = -sin(roll);
	vy = sin(pitch) * cos(roll);
	vz = cos(pitch) * cos(roll);

	gvx = (1.0 - Goffset) * vx;
	gvy = (1.0 - Goffset) * vy;
	gvz = (1.0 - Goffset) * vz;

	// update vertical acceleration using acceleration
	// vector to gravity vector projection
	va = (vx * ax + vy * ay + vz * az)
		/ sqrtf(vx * vx + vy * vy + vz * vz);

	dsp_updatelpf(Lpf + LPF_VAU, va);
	dsp_updatelpf(Lpf + LPF_VAPT1, va);
	dsp_updatelpf(Lpf + LPF_VAAVG, va);

	// write vertical acceleration into log	
	writelog(LOG_VACCEL, dsp_getlpf(Lpf + LPF_VAU));

	// calculate forward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = 0;
	vy = cos(pitch);
	vz = -sin(pitch);

	// update forward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_FA,
		(vx * (ax - gvx) + vy * (ay - gvy) + vz * (az - gvz))
		/ sqrtf(vx * vx + vy * vy + vz * vz));

	// write forward acceleration into log	
	writelog(LOG_FACCEL, dsp_getlpf(Lpf + LPF_FA));

	// calculate sideward direction vector in IMU
	// coordination system using pitch and roll values;
	vx = cos(roll);
	vy = sin(pitch) * sin(roll);
	vz = sin(roll) * cos(pitch);

	// update sideward acceleration using acceleration
	// vector to gravity vector projection
	dsp_updatelpf(Lpf + LPF_SA,
		(vx * (ax - gvx) + vy * (ay - gvy) + vz * (az - gvx))
		/ sqrtf(vx * vx + vy * vy + vz * vz));
	
	// write sideward acceleration into log	
	writelog(LOG_SACCEL, dsp_getlpf(Lpf + LPF_SA));

	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		// calculate speed through latitude from
		// forward and sideward accelerations and
		// GNSS speed using complimetary filter
		dsp_updatecompl(Cmpl + CMPL_SLAT,
			9.80665 * (
			+ dsp_getlpf(Lpf + LPF_FA) * cosf(yaw)
			- dsp_getlpf(Lpf + LPF_SA) * sinf(yaw))
			* dt, Gnss.speed / 3.6 * cosf(Gnss.course));

		// calculate speed through longitude from
		// forward and sideward accelerations and
		// GNSS speed using complimetary filter
		dsp_updatecompl(Cmpl + CMPL_SLON,
			9.80665 * (
			+ dsp_getlpf(Lpf + LPF_FA) * sinf(yaw)
			+ dsp_getlpf(Lpf + LPF_SA) * cosf(yaw))
			* dt, Gnss.speed / 3.6 * sinf(Gnss.course));

		// calculate latitude from speed and GNSS
		// latitude using complimentary filter
		dsp_updatecompl(Cmpl + CMPL_LAT,
			dsp_getcompl(Cmpl + CMPL_SLAT) * dt,
			dsp_getlpf(Lpf + LPF_LATM));

		// calculate longitude from speed and GNSS
		// latitude using complimentary filter
		dsp_updatecompl(Cmpl + CMPL_LON,
			dsp_getcompl(Cmpl + CMPL_SLON) * dt,
			dsp_getlpf(Lpf + LPF_LONM));

		// calculate horizontal speed from speed
		// values through longitude and latitude
		dsp_updatelpf(Lpf + LPF_SPEED,
			sqrtf(powf(dsp_getcompl(Cmpl + CMPL_SLAT), 2.0)
			+ powf(dsp_getcompl(Cmpl + CMPL_SLON), 2.0)));

		// write speed values through latitude and longitude,
		// horizontal speed, latitude and longitude into log
		writelog(LOG_SLAT, dsp_getcompl(Cmpl + CMPL_SLAT));
		writelog(LOG_SLON, dsp_getcompl(Cmpl + CMPL_SLON));
		writelog(LOG_SPEED, dsp_getlpf(Lpf + LPF_SPEED));
		writelog(LOG_LAT, dsp_getcompl(Cmpl + CMPL_LAT));
		writelog(LOG_LON, dsp_getcompl(Cmpl + CMPL_LON));
	}

	// get last barometric altitude
	alt = dsp_getlpf(Lpf + LPF_ALT);

	// calculate altitude thrust compensation
	altcor = St.adj.althold.alttha * dsp_getlpf(Lpf + LPF_AVGTHRA)
		+ St.adj.althold.altthb;
	altcor = (altcor < 0.0) ? 0.0 : altcor;

	// compensate thrust for altitude
	alt -= altcor;	

	// if GNSS is locked, use speed to compensate dynamic pressure
	if (Dev[DEV_GNSS].status == DEVSTATUS_INIT
			&& M10_HASFIX(Gnss.quality)) {
		float sp;

		sp = dsp_getlpf(Lpf + LPF_SPEED);

		altcor = St.adj.althold.altthc * sp * sp;
		alt -= altcor;
	}

	// calculate climb rate from vertical acceleration and
	// barometric altitude defference using complimentary filter
	dsp_updatecompl(Cmpl + CMPL_CLIMBRATE,
		9.80665 * (dsp_getlpf(Lpf + LPF_VAU) + Goffset - 1.0) * dt,
			(dsp_getcompl(Cmpl + CMPL_ALT) - prevalt) / dt);
	
